# DestinationFontName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontInfo..::..DestinationFontName Property
ExportFontInfo Class See Also
---
The destination font name (the name of the font in the exported format).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string DestinationFontName { get; set; }
```

Visual Basic
---
```text
Public Property DestinationFontName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ DestinationFontName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ExportFontInfo Class
Autodesk.Revit.DB Namespace